const Mysql = require('../sqldb/index'); // 引入MySQL数据库

const School = Mysql.School;// 将Sequelize与表结构对应

let schoolList =
    [
        {
            "name": "三之三金湖湾幼儿园",
            "address": "苏州工业园区南施街180号",
            "lnglat": [
                "120.740644",
                "31.322562"
            ],
            "type": "幼儿园"
        },
        {
            "name": "三之三唯亭幼儿园",
            "address": "苏州工业园区葑亭大道746号",
            "lnglat": [
                "120.797614",
                "31.364994"
            ],
            "type": "幼儿园"
        },
        {
            "name": "东港实验幼儿园(总园)",
            "address": "苏州工业园区东港新村综合楼",
            "lnglat": [
                "120.677339",
                "31.294463"
            ],
            "type": "幼儿园"
        },
        {
            "name": "翡翠幼儿园",
            "address": "苏州工业园区科意路18号",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "幼儿园"
        },
        {
            "name": "葑谊幼儿园(总园)",
            "address": "苏州工业园区葑谊街葑谊新村",
            "lnglat": [
                "120.666781",
                "31.294844"
            ],
            "type": "幼儿园"
        },
        {
            "name": "夏园幼儿园(徐家浜分园)",
            "address": "苏州工业园区徐家浜新村内",
            "lnglat": [
                "120.662557",
                "31.309552"
            ],
            "type": "幼儿园"
        },
        {
            "name": "康佳青剑湖幼儿园",
            "address": "苏州工业园区唯亭青剑湖动迁E区",
            "lnglat": [
                "120.710678",
                "31.361648"
            ],
            "type": "幼儿园"
        },
        {
            "name": "新加花园幼儿园",
            "address": "苏州工业园区现代大道138号",
            "lnglat": [
                "120.6816",
                "31.329375"
            ],
            "type": "幼儿园"
        },
        {
            "name": "新馨花园幼儿园",
            "address": "苏州工业园区苏茜路108号",
            "lnglat": [
                "120.666931",
                "31.314412"
            ],
            "type": "幼儿园"
        },
        {
            "name": "泾园幼儿园",
            "address": "苏州工业园区杨东路201号",
            "lnglat": [
                "120.66883",
                "31.345835"
            ],
            "type": "幼儿园"
        },
        {
            "name": "湖左岸国际幼儿园",
            "address": "苏州工业园区星汉街108号",
            "lnglat": [
                "120.682305",
                "31.318491"
            ],
            "type": "幼儿园"
        },
        {
            "name": "苏安幼儿园(总园)",
            "address": "苏州工业园区新苏苑一区",
            "lnglat": [
                "120.653594",
                "31.336871"
            ],
            "type": "幼儿园"
        },
        {
            "name": "东港实验幼儿园(金益分园)",
            "address": "苏州工业园区金益新村99幢",
            "lnglat": [
                "120.677339",
                "31.294463"
            ],
            "type": "幼儿园"
        },
        {
            "name": "水墨花园幼儿园",
            "address": "苏州工业园区水墨花园3号楼",
            "lnglat": [
                "120.760857",
                "31.326261"
            ],
            "type": "幼儿园"
        },
        {
            "name": "南师大学幼儿园",
            "address": "苏州工业园区苏胜路801号",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "幼儿园"
        },
        {
            "name": "东亭幼儿园(总园)",
            "address": "苏州工业园区东亭家园43幢",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "幼儿园"
        },
        {
            "name": "怡邻幼儿园(总园)",
            "address": "苏州工业园区怡邻二区",
            "lnglat": [
                "120.810629",
                "31.380547"
            ],
            "type": "幼儿园"
        },
        {
            "name": "东亭幼儿园(畅苑分园)",
            "address": "苏州工业园区畅苑三区31幢",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "幼儿园"
        },
        {
            "name": "怡邻幼儿园(青苑分园)",
            "address": "苏州工业园区青苑一区23幢",
            "lnglat": [
                "120.810629",
                "31.380547"
            ],
            "type": "幼儿园"
        },
        {
            "name": "天域幼儿园",
            "address": "苏州工业园区星汉街185号",
            "lnglat": [
                "120.680181",
                "31.324237"
            ],
            "type": "幼儿园"
        },
        {
            "name": "葑谊幼儿园(文萃分园)",
            "address": "苏州工业园区文萃路3号",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "幼儿园"
        },
        {
            "name": "斜塘街道中心幼儿园(荷韵分园)",
            "address": "苏州工业园区荷韵街荷韵新村内",
            "lnglat": [
                "120.737292",
                "31.303918"
            ],
            "type": "幼儿园"
        },
        {
            "name": "斜塘街道中心幼儿园(总园)",
            "address": "苏州工业园区莲香新村内",
            "lnglat": [
                "120.746418",
                "31.303034"
            ],
            "type": "幼儿园"
        },
        {
            "name": "车坊幼儿园(总园)",
            "address": "苏州工业园区淞泽家园九区内",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "幼儿园"
        },
        {
            "name": "莲花幼儿园",
            "address": "苏州工业园区莲花二区",
            "lnglat": [
                "120.747292",
                "31.294899"
            ],
            "type": "幼儿园"
        },
        // {
        //   "name": "斜塘实验幼儿园(莲塘分园)",
        //   "address": "苏州工业园区莲花新村五区内",
        //   "lnglat": [
        //     "120.553563",
        //     "31.87227"
        //   ],
        //   "type": "幼儿园"
        // },
        {
            "name": "贝尔亭苑实验幼儿园",
            "address": "苏州工业园区葑亭大道亭苑新村A区",
            "lnglat": [
                "120.773518",
                "31.367933"
            ],
            "type": "幼儿园"
        },
        {
            "name": "金色朝阳高尔夫幼儿园",
            "address": "苏州工业园区高尔夫花园16幢",
            "lnglat": [
                "120.693525",
                "31.299109"
            ],
            "type": "幼儿园"
        },
        {
            "name": "马荣教育橄榄湾幼儿园",
            "address": "苏州工业园区淞江路266号",
            "lnglat": [
                "120.731959",
                "31.307178"
            ],
            "type": "幼儿园"
        },
        {
            "name": "跨塘中心幼儿园(总园)",
            "address": "苏州工业园区跨南路高浜新村",
            "lnglat": [
                "120.695948",
                "31.350371"
            ],
            "type": "幼儿园"
        },
        {
            "name": "跨塘中心幼儿园(青剑湖分园)",
            "address": "苏州工业园区唯新路青剑湖花园",
            "lnglat": [
                "120.717686",
                "31.364089"
            ],
            "type": "幼儿园"
        },
        {
            "name": "宇祺朝阳亿城幼儿园",
            "address": "苏州工业园区榭雨街399号",
            "lnglat": [
                "120.76597",
                "31.343613"
            ],
            "type": "幼儿园"
        },
        {
            "name": "未来幼儿园",
            "address": "苏州工业园区沈浒路588号",
            "lnglat": [
                "120.644409",
                "31.497956"
            ],
            "type": "幼儿园"
        },
        {
            "name": "苏安幼儿园(新苏苑分园)",
            "address": "苏州工业园区苏安新村120幢",
            "lnglat": [
                "120.653594",
                "31.336871"
            ],
            "type": "幼儿园"
        },
        {
            "name": "富华苑幼儿园",
            "address": "苏州工业园区金鸡湖大道1号",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "幼儿园"
        },
        {
            "name": "新洲幼儿园",
            "address": "苏州工业园区长乐巷1号",
            "lnglat": [
                "120.733522",
                "31.319144"
            ],
            "type": "幼儿园"
        },
        {
            "name": "新纽顿玲珑湾幼儿园",
            "address": "苏州工业园区玲珑街1号",
            "lnglat": [
                "120.703644",
                "31.334895"
            ],
            "type": "幼儿园"
        },
        {
            "name": "翰林幼儿园",
            "address": "苏州工业园区林泉街600号",
            "lnglat": [
                "120.751656",
                "31.283376"
            ],
            "type": "幼儿园"
        },
        {
            "name": "天虹都市花园幼儿园",
            "address": "苏州工业园区星海街519号",
            "lnglat": [
                "120.674086",
                "31.324635"
            ],
            "type": "幼儿园"
        },
        {
            "name": "三之三加城幼儿园",
            "address": "苏州工业园区星汉街85号",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "幼儿园"
        },
        {
            "name": "新城花园幼儿园",
            "address": "苏州工业园区苏慕路77号",
            "lnglat": [
                "120.674141",
                "31.329437"
            ],
            "type": "幼儿园"
        },
        {
            "name": "佳艺御湖艺术幼儿园",
            "address": "苏州工业园区星州街89号",
            "lnglat": [
                "120.687772",
                "31.303442"
            ],
            "type": "幼儿园"
        },
        {
            "name": "大湖城邦幼儿园",
            "address": "苏州工业园区高和路63号",
            "lnglat": [
                "120.688777",
                "31.298457"
            ],
            "type": "幼儿园"
        },
        {
            "name": "东方岚谷欧洲城幼儿园",
            "address": "苏州工业园区南施街126号",
            "lnglat": [
                "120.740803",
                "31.316973"
            ],
            "type": "幼儿园"
        },
        {
            "name": "夏园幼儿园",
            "address": "苏州工业园区夏园新村内",
            "lnglat": [
                "120.662557",
                "31.309552"
            ],
            "type": "幼儿园"
        },
        {
            "name": "景城幼儿园",
            "address": "苏州工业园区九华路66号",
            "lnglat": [
                "120.731122",
                "31.334628"
            ],
            "type": "幼儿园"
        },
        {
            "name": "星湖幼儿园(分园)",
            "address": "苏州工业园区普惠路淞泽家园四区",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "幼儿园"
        },
        // {
        //   "name": "斜塘实验幼儿园(总园)",
        //   "address": "苏州工业园区莲花新村七区内",
        //   "lnglat": [
        //     "120.553563",
        //     "31.87227"
        //   ],
        //   "type": "幼儿园"
        // },
        {
            "name": "为明幼儿园",
            "address": "苏州工业园区榭雨街66号",
            "lnglat": [
                "120.774031",
                "31.309897"
            ],
            "type": "幼儿园"
        },
        {
            "name": "昂立幼儿园",
            "address": "苏州工业园区榭雨街238号",
            "lnglat": [
                "120.583455",
                "31.338567"
            ],
            "type": "幼儿园"
        },
        {
            "name": "胜浦金光幼儿园(吴淞分园)",
            "address": "苏州工业园区通江路6号",
            "lnglat": [
                "120.835223",
                "31.31255"
            ],
            "type": "幼儿园"
        },
        {
            "name": "胜浦金光幼儿园(浪花苑分园)",
            "address": "苏州工业园区浪花弄2号",
            "lnglat": [
                "120.839092",
                "31.300146"
            ],
            "type": "幼儿园"
        },
        {
            "name": "胜浦金光幼儿园(滨江苑分园)",
            "address": "苏州工业园区胜浦街道滨江苑内",
            "lnglat": [
                "120.844194",
                "31.296197"
            ],
            "type": "幼儿园"
        },
        {
            "name": "跨塘中心幼儿园(张泾分园)",
            "address": "苏州工业园区葑亭大道高浜六区",
            "lnglat": [
                "120.695956",
                "31.350308"
            ],
            "type": "幼儿园"
        },
        {
            "name": "新纽顿上郡幼儿园",
            "address": "苏州工业园区亭友街89号",
            "lnglat": [
                "120.726262",
                "31.380084"
            ],
            "type": "幼儿园"
        },
        {
            "name": "宇褀朝阳澜溪苑幼儿园",
            "address": "苏州工业园区港田路511号",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "幼儿园"
        },
        {
            "name": "独墅湖幼儿园",
            "address": "苏州工业园区八达路东、启月路北",
            "lnglat": [
                "120.732599",
                "31.257875"
            ],
            "type": "幼儿园"
        },
        {
            "name": "星湖幼儿园",
            "address": "苏州工业园区斜塘街道淞泽8区内",
            "lnglat": [
                "120.735876",
                "31.248587"
            ],
            "type": "幼儿园"
        },
        {
            "name": "星慧幼儿园",
            "address": "苏州工业园区津梁街东、钟园路北",
            "lnglat": [
                "120.747288",
                "31.327116"
            ],
            "type": "幼儿园"
        },
        {
            "name": "东方维罗纳幼儿园",
            "address": "苏州工业园区青澄路8号",
            "lnglat": [
                "120.75685",
                "31.377756"
            ],
            "type": "幼儿园"
        },
        {
            "name": "新娄幼儿园",
            "address": "方湾街89号",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "幼儿园"
        },
        {
            "name": "悦澜湾幼儿园",
            "address": "唯新路88号",
            "lnglat": [
                "120.728001",
                "31.365136"
            ],
            "type": "幼儿园"
        },
        {
            "name": "水墨江南幼儿园",
            "address": "东华林街39号",
            "lnglat": [
                "120.728588",
                "31.291845"
            ],
            "type": "幼儿园"
        },
        {
            "name": "维多利亚幼儿园",
            "address": "玲珑街1号",
            "lnglat": [
                "120.699782",
                "31.334734"
            ],
            "type": "幼儿园"
        },
        {
            "name": "尚城幼儿园",
            "address": "东沙湖路116号",
            "lnglat": [
                "120.759627",
                "31.338614"
            ],
            "type": "幼儿园"
        },
        {
            "name": "锦溪苑幼儿园",
            "address": "锦溪苑三期",
            "lnglat": [
                "120.768331",
                "31.312131"
            ],
            "type": "幼儿园"
        },
        {
            "name": "中信森林湖幼儿园",
            "address": "亭盛街68号",
            "lnglat": [
                "120.720747",
                "31.384727"
            ],
            "type": "幼儿园"
        },
        {
            "name": "二十一世纪实验幼儿园",
            "address": "苏州工业园区方洲路495号 苏州工业园区方洲路495号",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "幼儿园"
        },
        {
            "name": "幼师童梦幼儿园",
            "address": "琉璃街25号",
            "lnglat": [
                "120.754143",
                "31.315731"
            ],
            "type": "幼儿园"
        },
        {
            "name": "星慧幼儿园分园",
            "address": "丰茂巷52号",
            "lnglat": [
                "120.726695",
                "31.297385"
            ],
            "type": "幼儿园"
        },
        {
            "name": "奇智绿地幼儿园",
            "address": "九华路20号",
            "lnglat": [
                "120.736343",
                "31.334522"
            ],
            "type": "幼儿园"
        },
        {
            "name": "加拿大国际幼儿园",
            "address": "海尚壹品",
            "lnglat": [
                "120.720812",
                "31.334477"
            ],
            "type": "幼儿园"
        },
        {
            "name": "唯亭悬珠幼儿园",
            "address": "悬珠花园东区",
            "lnglat": [
                "120.797614",
                "31.364994"
            ],
            "type": "幼儿园"
        },
        {
            "name": "新纽顿会心街幼儿园",
            "address": "湖东邻里中心",
            "lnglat": [
                "120.736227",
                "31.320958"
            ],
            "type": "幼儿园"
        },
        {
            "name": "香缇澜湾幼儿园",
            "address": "香缇澜湾花园",
            "lnglat": [
                "120.665673",
                "31.354993"
            ],
            "type": "幼儿园"
        },
        {
            "name": "伊顿幼儿园",
            "address": "白塘路55号",
            "lnglat": [
                "120.744826",
                "31.376415"
            ],
            "type": "幼儿园"
        },
        {
            "name": "苏州幼师幼儿园",
            "address": "星湖街1211号",
            "lnglat": [
                "120.726695",
                "31.297385"
            ],
            "type": "幼儿园"
        },
        {
            "name": "戈巷幼儿园",
            "address": "畅苑环路25号",
            "lnglat": [
                "120.78403",
                "31.365365"
            ],
            "type": "幼儿园"
        },
        {
            "name": "文萃小学",
            "address": "苏州工业园区文萃路1号",
            "lnglat": [
                "120.668868",
                "31.284955"
            ],
            "type": "小学"
        },
        {
            "name": "跨塘实验小学(高浜校区)",
            "address": "苏州工业园区跨南路77号",
            "lnglat": [
                "120.697024",
                "31.349379"
            ],
            "type": "小学"
        },
        {
            "name": "方洲小学",
            "address": "苏州工业园区琉璃街6号",
            "lnglat": [
                "120.755526",
                "31.316896"
            ],
            "type": "小学"
        },
        {
            "name": "星洋学校小学部",
            "address": "苏州工业园区榭雨街18号",
            "lnglat": [
                "120.774215",
                "31.307063"
            ],
            "type": "小学"
        },
        {
            "name": "唯亭实验小学",
            "address": "苏州工业园区夷亭路219号",
            "lnglat": [
                "120.794261",
                "31.371187"
            ],
            "type": "小学"
        },
        {
            "name": "翰林小学",
            "address": "苏州工业园区林泉街566号",
            "lnglat": [
                "120.753786",
                "31.280813"
            ],
            "type": "小学"
        },
        {
            "name": "新城花园小学",
            "address": "苏州工业园区苏慕路77号",
            "lnglat": [
                "120.674141",
                "31.329437"
            ],
            "type": "小学"
        },
        {
            "name": "星海小学",
            "address": "苏州工业园区苏茜路68号",
            "lnglat": [
                "120.67167",
                "31.314792"
            ],
            "type": "小学"
        },
        {
            "name": "胜浦实验小学",
            "address": "苏州工业园区兴浦路16号",
            "lnglat": [
                "120.837897",
                "31.302712"
            ],
            "type": "小学"
        },
        {
            "name": "苏州工业园区第二实验小学",
            "address": "苏州工业园区方洲路666号",
            "lnglat": [
                "120.741149",
                "31.320577"
            ],
            "type": "小学"
        },
        {
            "name": "车坊实验小学",
            "address": "苏州工业园区蔺谊西路8号",
            "lnglat": [
                "120.757006",
                "31.251254"
            ],
            "type": "小学"
        },
        {
            "name": "娄葑实验小学(本部)",
            "address": "苏州工业园区葑春街2号",
            "lnglat": [
                "120.677091",
                "31.293177"
            ],
            "type": "小学"
        },
        {
            "name": "娄葑实验小学(夏园校区)",
            "address": "苏州工业园区夏园新村内",
            "lnglat": [
                "120.677091",
                "31.293177"
            ],
            "type": "小学"
        },
        {
            "name": "跨塘实验小学虹桥校区",
            "address": "苏州工业园区唯新路",
            "lnglat": [
                "120.719832",
                "31.362552"
            ],
            "type": "小学"
        },
        {
            "name": "星洲小学",
            "address": "苏州工业园区津梁街东、钟园路北",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "小学"
        },
        {
            "name": "车坊实验小学淞泽校区",
            "address": "金园路8号（润泽路南、新平街西）",
            "lnglat": [
                "120.757006",
                "31.251254"
            ],
            "type": "小学"
        },
        {
            "name": "莲花学校小学部",
            "address": "苏州工业园区莲池街8号",
            "lnglat": [
                "120.747303",
                "31.290513"
            ],
            "type": "小学"
        },
        {
            "name": "星湾学校小学部",
            "address": "苏州工业园区玲珑街8号",
            "lnglat": [
                "120.707511",
                "31.33541"
            ],
            "type": "小学"
        },
        {
            "name": "星港学校(本部)小学部",
            "address": "苏州工业园区飘一路9号",
            "lnglat": [
                "120.660324",
                "31.320666"
            ],
            "type": "小学"
        },
        {
            "name": "星汇学校小学部",
            "address": "苏州工业园区方洲路428号",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "小学"
        },
        {
            "name": "唯亭学校小学部",
            "address": "苏州工业园区唯亭镇畅苑环路",
            "lnglat": [
                "120.780134",
                "31.36618"
            ],
            "type": "小学"
        },
        {
            "name": "星澄学校小学部",
            "address": "苏州工业园区科智路18号",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "小学"
        },
        {
            "name": "金鸡湖学校小学部",
            "address": "苏州工业园区石港路18号",
            "lnglat": [
                "120.727764",
                "31.303599"
            ],
            "type": "小学"
        },
        {
            "name": "青剑湖学校小学部",
            "address": "苏州工业园区亭友街99号",
            "lnglat": [
                "120.72639",
                "31.382463"
            ],
            "type": "小学"
        },
        {
            "name": "娄葑学校小学部",
            "address": "苏州工业园区扬东路200号",
            "lnglat": [
                "120.661802",
                "31.321094"
            ],
            "type": "小学"
        },
        {
            "name": "星港学校(东港校区)小学部",
            "address": "苏州工业园区东港新村内",
            "lnglat": [
                "120.660324",
                "31.320666"
            ],
            "type": "小学"
        },
        {
            "name": "星港学校(苏安校区)小学部",
            "address": "苏州工业园区苏安新村内",
            "lnglat": [
                "120.656619",
                "31.334646"
            ],
            "type": "小学"
        },
        {
            "name": "独墅湖学校小学部",
            "address": "苏州工业园区启月街8号",
            "lnglat": [
                "120.732931",
                "31.256518"
            ],
            "type": "小学"
        },
        {
            "name": "景城学校小学部",
            "address": "苏州工业园区九华路99号",
            "lnglat": [
                "120.728084",
                "31.334203"
            ],
            "type": "小学"
        },
        {
            "name": "星浦学校小学部",
            "address": "苏州工业园区沽浦路6号",
            "lnglat": [
                "120.831003",
                "31.313785"
            ],
            "type": "小学"
        },
        {
            "name": "东沙湖学校小学部",
            "address": "苏州工业园区东沙湖路99号",
            "lnglat": [
                "120.764901",
                "31.336914"
            ],
            "type": "小学"
        },
        {
            "name": "星澜学校小学部",
            "address": "科剑街西、唯新路北",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "小学"
        },
        {
            "name": "星湖学校(原园区五中)小学部",
            "address": "苏州工业园区蠡塘路1号",
            "lnglat": [
                "120.604199",
                "31.318637"
            ],
            "type": "小学"
        },
        {
            "name": "星浦学校",
            "address": "苏州工业园区兴浦路55号",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "中学"
        },
        {
            "name": "西交大附属初中",
            "address": "苏州工业园区津梁街10号",
            "lnglat": [
                "120.746821",
                "31.280931"
            ],
            "type": "中学"
        },
        {
            "name": "星海实验中学",
            "address": "苏州工业园区苏茜路18号",
            "lnglat": [
                "120.675375",
                "31.315571"
            ],
            "type": "中学"
        },
        // {
        //   "name": "园区一中",
        //   "address": "苏州工业园区东振路88号",
        //   "lnglat": [
        //     "120.741229",
        //     "31.651095"
        //   ],
        //   "type": "中学"
        // },
        {
            "name": "斜塘学校",
            "address": "苏州工业园区敦煌路1号",
            "lnglat": [
                "120.73107",
                "31.30454"
            ],
            "type": "中学"
        },
        {
            "name": "园区八中",
            "address": "苏州工业园区长江路18号",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "中学"
        },
        {
            "name": "苏大附中",
            "address": "苏州工业园区东振路29号",
            "lnglat": [
                "120.669354",
                "31.298097"
            ],
            "type": "中学"
        },
        {
            "name": "星湖学校(原园区五中)",
            "address": "苏州工业园区蠡塘路1号",
            "lnglat": [
                "120.604199",
                "31.318637"
            ],
            "type": "中学"
        },
        {
            "name": "娄葑学校",
            "address": "苏州工业园区扬东路1号",
            "lnglat": [
                "120.668121",
                "31.346814"
            ],
            "type": "中学"
        },
        {
            "name": "青剑湖学校",
            "address": "苏州工业园区亭友街99号",
            "lnglat": [
                "120.72639",
                "31.382463"
            ],
            "type": "中学"
        },
        {
            "name": "金鸡湖学校",
            "address": "苏州工业园区石港路18号",
            "lnglat": [
                "120.727764",
                "31.303599"
            ],
            "type": "中学"
        },
        {
            "name": "唯亭学校",
            "address": "苏州工业园区亭学街9号",
            "lnglat": [
                "120.780134",
                "31.36618"
            ],
            "type": "中学"
        },
        {
            "name": "星港学校(本部)",
            "address": "苏州工业园区飘一路9号",
            "lnglat": [
                "120.660324",
                "31.320666"
            ],
            "type": "中学"
        },
        {
            "name": "景城学校",
            "address": "苏州工业园区九华路99号",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "中学"
        },
        {
            "name": "星海学校中学育才校区",
            "address": "苏州工业园区扬东路211号",
            "lnglat": [
                "120.666478",
                "31.344862"
            ],
            "type": "中学"
        },
        // {
        //   "name": "园区二中",
        //   "address": "苏州工业园区唯亭街道金埂路1号",
        //   "lnglat": [
        //     "120.548063",
        //     "31.875084"
        //   ],
        //   "type": "中学"
        // },
        {
            "name": "西交大苏州附中",
            "address": "苏州工业园区方洲路598号",
            "lnglat": [
                "120.746821",
                "31.280931"
            ],
            "type": "中学"
        },
        {
            "name": "星港学校(苏安校区)",
            "address": "苏州工业园区苏安新村内",
            "lnglat": [
                "120.656751",
                "31.334373"
            ],
            "type": "中学"
        },
        {
            "name": "星港学校(东港校区)",
            "address": "苏州工业园区东港新村内",
            "lnglat": [
                "120.66032",
                "31.326346"
            ],
            "type": "中学"
        },
        {
            "name": "独墅湖学校",
            "address": "苏州工业园区八达路东、启月路北",
            "lnglat": [
                "120.732931",
                "31.256518"
            ],
            "type": "中学"
        },
        {
            "name": "星澄学校",
            "address": "科智路18号",
            "lnglat": [
                "120.619907",
                "31.317987"
            ],
            "type": "中学"
        },
        {
            "name": "星洋学校",
            "address": "港田路501号",
            "lnglat": [
                "120.774215",
                "31.307063"
            ],
            "type": "中学"
        },
        {
            "name": "星汇学校",
            "address": "苏州工业园区方洲路北钟南街东",
            "lnglat": [
                "120.765592",
                "31.321379"
            ],
            "type": "中学"
        },
        {
            "name": "星澜学校",
            "address": "科剑街西、唯新路北",
            "lnglat": [
                "120.731456",
                "31.364885"
            ],
            "type": "中学"
        },
        {
            "name": "东沙湖学校",
            "address": "现代大道北、琉璃街西",
            "lnglat": [
                "120.764901",
                "31.336914"
            ],
            "type": "中学"
        },
        {
            "name": "莲花学校",
            "address": "苏州工业园区莲池街8号",
            "lnglat": [
                "120.747303",
                "31.290513"
            ],
            "type": "中学"
        },
        {
            "name": "星湾学校初中部",
            "address": "苏州工业园区玲珑街8号",
            "lnglat": [
                "120.707511",
                "31.33541"
            ],
            "type": "中学"
        }
    ]

initPyData()

function initPyData() {
    let schoolArr = []
    schoolList.forEach(async function (item) {
        let schoolItem = {
            xue_xiao_ming_cheng:item.name,
            suo_su_di_qu:item.address,
            xue_xiao_lei_xing:item.type,
            ban_xue_xing_zhi:null,
            jian_xiao_shi_jian:null,
            jing_du:item.lnglat[0],
            wei_du:item.lnglat[1],
        }
        schoolArr.push(schoolItem)

    })

    School.bulkCreate(schoolArr).catch(function (err) {
        console.log("发生错误：" + err);
    });
}

// checkSchool()
async function checkSchool(){
    let schoolArr = await   School.findAndCountAll({where: {jing_du: 0,wei_du: 0}}).catch(function (err) {
        console.log("发生错误：" + err);
    });
    console.log(schoolArr.count)
}


